easy/README.org
#+TITLE: Leetcode Easy Solutions
#+AUTHOR: lloydlobo
#+STARTUP: fold
#+OPTIONS: num:nil ^:{}
# #+PROPERTY: header-args :main no :comments link :noweb yes
# #+PROPERTY: header-args :tangle yes :results none
-----

* Table Of Contents :toc:
- [[#0001-two-sum][0001. TWO SUM]]
  - [[#source][Source]]
  - [[#explanation][Explanation]]
  - [[#alternatives][Alternatives]]
- [[#0009-palindrome-number][0009. PALINDROME NUMBER]]
  - [[#source-1][Source]]
- [[#0175-combine-two-tables][0175. COMBINE TWO TABLES]]
  - [[#source-2][SOURCE]]
- [[#0344-reverse-string][0344-reverse-string]]
  - [[#go][Go]]
  - [[#explanation-1][Explanation]]
- [[#0412-fizz-buzz][0412. FIZZ BUZZ]]
  - [[#source-3][Source]]
  - [[#explanation-2][Explanation]]
  - [[#examples][Examples]]
  - [[#constraints][Constraints]]
  - [[#complexity][Complexity]]
- [[#0628-maximum-product-of-three-numbers][0628. MAXIMUM PRODUCT OF THREE NUMBERS]]
  - [[#source-4][Source]]
  - [[#explanation-3][Explanation]]
  - [[#constraints-1][Constraints]]
  - [[#examples-1][Examples]]
- [[#0704-binary-search][0704. BINARY SEARCH]]
  - [[#source-5][Source]]
  - [[#explanation-4][Explanation]]
  - [[#constraints-2][Constraints:]]
- [[#1752-check-if-array-is-sorted-and-rotated][1752. Check if Array Is Sorted and Rotated]]
  - [[#source-6][Source]]
  - [[#explanation-5][Explanation]]
  - [[#examples-2][Examples]]
- [[#1913-maximum-product-difference-between-two-pairs][1913. Maximum Product Difference Between Two Pairs]]
  - [[#sort][sort]]
  - [[#clone][clone]]
  - [[#minmax][minmax]]

* 0001. TWO SUM
** Source
#+NAME: two-sum
#+begin_src go :tangle ./0001_two-sum/main.go :noweb yes :comments link
package main

import "fmt"

func twoSum(nums []int, target int) []int {
	len := len(nums)
	for i := 0; i < len-1; i += 1 {
		for j := i + 1; j < len; j += 1 {
			sum := nums[i] + nums[j]
			if sum == target {
				return []int{i, j}
			}
		}
	}

	return []int{}
}

func main() {
	fmt.Println("001_two-sum/main.go: main()")
	nums := []int{2, 7, 10, 15}
	target := 9
	output := twoSum(nums, target)
	fmt.Println("\nOutput:", output)
}
#+end_src

#+RESULTS: two-sum
: 001_two-sum/main.go: main()
:
: Output: [0 1]

** Explanation
URL: https://www.code-recipe.com/post/two-sum
 - For a given input array this algorithm does the following steps:
 - Create a hashmap which accepts integer datatype as key and value.
 - Iterate through each element in the given array starting from the first element.
 - In each iteration check if required number (required  number = target sum - current number) is present in the hashmap.
 - If present, return {required number index, current number index} as  result.
 - Otherwise add the current iteration number as key and its index as value to the hashmap. Repeat this  until you find the result.

** Alternatives
#+NAME: two-sum alternative
#+begin_src go
package main

import (
	"fmt"
	"time"
)

/*
 ,* twoSum()
 ,*
 ,* Runtime: 45 ms, faster than 23.21% of go online submissions for two sum.
 ,* Memory Usage: 3.7 MB, less than 75.17% of Go online submissions for Two Sum.
 ,*/
func twoSum(nums []int, target int) []int {
	len := len(nums)
	for i := 0; i < len-1; i += 1 {
		formain() {
	nums := []int{2, 7, 11, 15}
	target := 9
	output := twoSum(nums, target)
	fmt.Println("Output:", output)
}

/* https://www.code-recipe.com/post/two-sum
 ,* For a given input array this algorithm does the following steps:
 ,* Create a hashmap which accepts integer datatype as key and value.
 ,* Iterate through each element in the given array starting from the first element.
 ,* In each iteration check if required number (required  number = target sum - current number) is present in the hashmap.
 ,* If present, return {required number index, current number index} as  result.
 ,* Otherwise add the current iteration number as key and its index as value to the hashmap. Repeat this  until you find the result.
 ,*/
func twoSumIsSeenMapnums(nums []int, target int) []int {
	// Create a hashmap which accepts integer datatype as key and value.
	mapIndex := make(map[int]int)
	// Iterate through each element in the given array starting from the first element.
	for idxCurr, numCurr := range nums {
		// In each iteration check if required number (required  number = target sum - current number) is present in the hashmap.
		if idxRequired, isPresent := mapIndex[target-numCurr]; isPresent {
			return []int{idxRequired, idxCurr}
		}
		// Otherwise add the current iteration number as key and its index as value to the hashmap.
		// Repeat this  until you find the result.
		mapIndex[numCurr] = idxCurr
	}

	return []int{}
}

// With slices leave out the element count => Array [4]String or [...]String (compiler will count it)
func sleep(n int) {
	for { // Run infinite loop
		if n <= 0 {
			break // if n is reduced to or below zero break loop
		} else {
			loadingChar := "."
			fmt.Printf("%v", loadingChar)
			time.Sleep(300 * time.Millisecond) // wait 300 milliseconds
			n -= 1                             // reverse countdown
		}
	}
}

// func slice() { var intSlice []int var strSlice []string fmt.Println(reflect.ValueOf(intSlice).Kind()) fmt.Println(reflect.ValueOf(strSlice).Kind()) }
func getIndex(prev int, curr int, i int, j int, target int) []int {
	sum := curr + prev
	fmt.Println("func getIndex Output: num at index", i, "and", j, "is", sum)
	return []int{i, j}
}

func twoSumSlice(nums []int, target int) []int {
	var result []int
	var sliceResult [][]int
	lenNums := len(nums)

	for i := 0; i <= lenNums-1; i += 1 {
		for j := 0; j <= lenNums-1; j += 1 {
			prev := nums[i]
			curr := nums[j]
			/* sleep(3)
			fmt.Println("", prev, curr) */
			if curr+prev == target {
				result = getIndex(prev, curr, i, j, target)
				resultSlice := [][]int{result}
				// arrResult = append(arrResult, result...)
				sliceResult = append(sliceResult, resultSlice...)
				fmt.Println("result:", result)
			}

		}
	}

	return sliceResult[0]
}

// Time: O(n*n) = O(n^2)
// Space: O(1)

func twoSumForLoop(nums []int, target int) []int {
	// O(n)
	for i := 0; i < len(nums)-1; i++ {
		// O(n)
		for j := i + 1; j < len(nums); j++ {
			// Time: O(1)
			if nums[i]+nums[j] == target {
				return []int{i, j}
			}
		}
	}
	return []int{}
}

/* for i := 0; i < len(arrResult); i += 1 {
	arr := arrResult[i]

	for j := 0; j < len(arr); j += 1 {
		slice := arrResult[i][j]
		fmt.Print(" slice: ", slice, " i: ", i, " j: ", j, arrResult[i], arrResult[j])
	}
}
fmt.Println("\narrResult:", arrResult) */

func twoSumHashMap(nums []int, target int) []int {
	seenNums := make(map[int]int)
	for index, thisNum := range nums {
		if seenIndex, ok := seenNums[target-thisNum]; ok {
			return []int{seenIndex, index}
		}
		seenNums[thisNum] = index
	}
	return []int{0, 0} // Should not happen
}
#+end_src
* 0009. PALINDROME NUMBER
** Source
#+NAME: palindrome-number
#+begin_src go :tangle ./0009_palindrome-number/main.go :comments link :noweb yes
package main

// works
import (
	"fmt"
	"strconv"
	// "strings"
)

/*
	 reverseStr() Function.
		  https://www.geeksforgeeks.org/how-to-reverse-a-string-in-golang/
			type string string
			string is the set of all strings of 8\-bit bytes, conventionally but not necessarily representing UTF\-8\-encoded text\.
			A string may be empty, but not nil\. Values of string type are immutable\. [`string` on pkg.go.dev](https://pkg.go.dev/builtin?utm_source=gopls#string)
*/
func reverseStr(str string) (result string) {
	// Append the result at each for loop turn at the end of string.
	for _, v := range str {
		result = string(v) + result
	}
	return
}

func isPalindrome(x int) bool {
	strX := strconv.FormatInt(int64(x), 10)
	strRevX := reverseStr(strX)
	return strX == strRevX
} // fmt.Println("strX:", strX, "strings", strRevX)

func printResult(int int) {
	result := isPalindrome(int)
	fmt.Println("Output:", int, "isPalindrome", result)
}

// ────────────────────────────────────────────────────────────────────────────
func main() {
	sliceIntNums := []int{121, 212, 123, 101}
	for _, intNum := range sliceIntNums {
		printResult(intNum)
	}
}
#+end_src

#+RESULTS:
: Output: true
* 0175. COMBINE TWO TABLES
** SOURCE
*** MYSQL
#+NAME: 0175-combine-two-tables
#+begin_src sql :tangle ./0175-combine-two-tables/my.sql :comments link :noweb yes :main no
--
# 0175. Combine Two Tables
--
-- Write an SQL query to report the first name, last name, city, and state of each person in the Person table. If the address of a personId is not present in the Address table, report null instead.
-- Return the result table in any order.
--
-- https://leetcode.com/problems/combine-two-tables/
--
-- Runtime: 598 ms.
-- Memory:  0B.

SELECT Person.firstName, Person.lastName, Address.city, Address.state
FROM Person LEFT JOIN Address
ON Person.personId = Address.personId

-- ---------------------------------------------------

-- +-----------+----------+---------------+----------+
-- | firstName | lastName | city          | state    |
-- +-----------+----------+---------------+----------+
-- | Allen     | Wang     | Null          | Null     |
-- | Bob       | Alice    | New York City | New York |
-- +-----------+----------+---------------+----------+

-- --------------------------------------------------

-- Example 1:
--
-- Input:
-- Person table:
-- +----------+----------+-----------+
-- | personId | lastName | firstName |
-- +----------+----------+-----------+
-- | 1        | Wang     | Allen     |
-- | 2        | Alice    | Bob       |
-- +----------+----------+-----------+
-- Address table:
-- +-----------+----------+---------------+------------+
-- | addressId | personId | city          | state      |
-- +-----------+----------+---------------+------------+
-- | 1         | 2        | New York City | New York   |
-- | 2         | 3        | Leetcode      | California |
-- +-----------+----------+---------------+------------+
-- Output:
-- +-----------+----------+---------------+----------+
-- | firstName | lastName | city          | state    |
-- +-----------+----------+---------------+----------+
-- | Allen     | Wang     | Null          | Null     |
-- | Bob       | Alice    | New York City | New York |
-- +-----------+----------+---------------+----------+
-- Explanation:
-- There is no address in the address table for the personId = 1 so we return null in their city and state.
-- addressId = 1 contains information about the address of personId = 2.

-- ---------------------------------------------------

-- SQL Schema
--
-- Table: Person
--
-- +-------------+---------+
-- | Column Name | Type    |
-- +-------------+---------+
-- | personId    | int     |
-- | lastName    | varchar |
-- | firstName   | varchar |
-- +-------------+---------+
-- personId is the primary key column for this table.
-- This table contains information about the ID of some persons and their first and last names.
--
--
--
-- Table: Address
--
-- +-------------+---------+
-- | Column Name | Type    |
-- +-------------+---------+
-- | addressId   | int     |
-- | personId    | int     |
-- | city        | varchar |
-- | state       | varchar |
-- +-------------+---------+
-- addressId is the primary key column for this table.
-- Each row of this table contains information about the city and state of one person with ID = PersonId.
--
--
--
-- Write an SQL query to report the first name, last name, city, and state of each person in the Person table. If the address of a personId is not present in the Address table, report null instead.
--
-- Return the result table in any order.
--
-- The query result format is in the following example.
--
--
#+end_src
* 0344-reverse-string
** Go
#+name: 0344-reverse-string/go
#+begin_src go :tangle ./0344-reverse-string/go/algo/reverse_string.go :noweb yes :comments link :main no
package algo

// Write a function that reverses a string.
// - The input string is given as an array of characters s.
// - You must do this by modifying the input array in-place with O(1) extra memory.
// Constraints:
// 1 <= s.length <= 105
// s[i] is a printable ascii character.
func ReverseString(s []byte) string{
	return "Hello"
}



#+end_src

#+RESULTS:

** Explanation
Write a function that reverses a string.
- The input string is given as an array of characters s.
- You must do this by modifying the input array in-place with O(1) extra memory.
*** Constraints:
1 <= s.length <= 105
s[i] is a printable ascii character.
*** Example 1:
#+begin_example
Input: s = ["h","e","l","l","o"]
Output: ["o","l","l","e","h"]
#+end_example
*** Example 2:
#+begin_example
Input: s = ["H","a","n","n","a","h"]
Output: ["h","a","n","n","a","H"]
#+end_example


* 0412. FIZZ BUZZ
** Source
*** Go
