easy/README.org
**** main
#+begin_src go :tangle ./0412_fizz-buzz/main.go :main no :noweb yes :comments link
package main

import (
	"fmt"
	"strconv"
)

// fizzBuzz function swaps any integer divisible by 3, 5, or 15.
//
// # Brute Force
// Given a number n, Run a loop from 1 to n
//
//	If a number is divisible by 15.Print FizzBuzz
//	Else If a number is divisible by 3.Print Fizz
//	Else a number is divisible by 3.Print Buzz
//
// # Constraints:
//   - `1 <= n <= 104`
//
// https://www.tutorialcup.com/interview/algorithm/fizz-buzz.html
// Time complexity = O(n) where n is the number till we have to print the values in the fizz buzz way.
// Space Complexity = O(n).
// https://leetcode.com/problems/fizz-buzz/submissions/
// Runtime: 10 ms.
// Memory Usage: 4.3 MB.
func fizzBuzz(n int) []string {
	var output []string

	for i := 1; i < n+1; i++ {
		output = append(output, fmt.Sprint(i))

		if (i)%15 == 0 {
			output[i-1] = "FizzBuzz"
		} else if (i)%3 == 0 {
			output[i-1] = "Fizz"
		} else if (i)%5 == 0 {
			output[i-1] = "Buzz"
		}
		// FIXME: Add an `else` statement to append `i` to `output` slice
		// when `i` is not divisible by 3,5,15.
	}
	return output
}

// FizzBuzzAppend()
//
// Time complexity = O(n) where n is the number till we have to print the values in the fizz buzz way.
// Space Complexity = O(n).
//
// Runtime: 7 ms.
// Memory Usage: 3.4 MB.
func FizzBuzzAppend(n int) []string {
	var arr = make([]string, 0, n) // The make built\-in function allocates and initializes an object of type slice, map, or chan (only).

	for i := 1; i < n+1; i++ {
		if (i)%15 == 0 {
			arr = append(arr, "FizzBuzz")
		} else if (i)%3 == 0 {
			arr = append(arr, "Fizz")
		} else if (i)%5 == 0 {
			arr = append(arr, "Buzz")
		} else {
			arr = append(arr, strconv.Itoa(i)) // Itoa is equivalent to FormatInt(int64(i), 10).
		}
	}
	return arr
}

// main function to print the output to console.
func main() {
	n := 16
	fmt.Printf("fizzBuzz: %v\n", fizzBuzz(n))
	n = 16
	fmt.Printf("fizzBuzz: %v\n", FizzBuzzAppend(n))
}

//   conversion from int to string yields a string of one rune, not a string of digits (did you mean fmt.Sprint(x)?) stringintconv [11, 27]
#+end_src

** Explanation
Given an integer n, return a string array answer (1-indexed) where:
#+begin_example go
answer[i] == "FizzBuzz" if i is divisible by 3 and 5.
answer[i] == "Fizz" if i is divisible by 3.
answer[i] == "Buzz" if i is divisible by 5.
answer[i] == i (as a string) if none of the above conditions are true.
#+end_example

** Examples
*** Example 1:
Input: n = 3
Output: ["1","2","Fizz"]
*** Example 2:
Input: n = 5
Output: ["1","2","Fizz","4","Buzz"]
*** Example 3:
Input: n = 15
Output: ["1","2","Fizz","4","Buzz","Fizz","7","8","Fizz","Buzz","11","Fizz","13","14","FizzBuzz"]
** Constraints
- 1 <= n <= 104
** Complexity
- Time complexity = O(n) where n is the number till we have to print the values in the fizz buzz way.
- Space Complexity = O(n).
* 0628. MAXIMUM PRODUCT OF THREE NUMBERS
** Source
*** Go
#+NAME: maximum-product-of-three-numbers
#+begin_src go :tangle ./0628_maximum-product-of-three-numbers/main.go :noweb yes :comments link :main no

// 628. Maximum Product of Three Numbers.
//
// Given an integer array nums, find three numbers whose product is maximum and return the maximum product.
//
// Example 1:
// Input: nums = [1,2,3]
// Output: 6
//
// Example 2:
// Input: nums = [1,2,3,4]
// Output: 24
//
// Example 3:
// Input: nums = [-1,-2,-3]
// Output: -6
//
// Constraints:
// - 3 <= nums.length <= 104
// - -1000 <= nums[i] <= 1000
package main

import (
	"github.com/lloydlobo/leetcode/singlescan"
	"github.com/lloydlobo/leetcode/sorting"
	"github.com/lloydlobo/leetcode/testcases"
)

func main() {
	arrNums, arrWant := testcases.GetMainArgs()
	n := len(arrNums) - 1

	testcases.ExecForLoop(singlescan.MaximumProductSingleScan, arrNums, arrWant, n)
	testcases.ExecForLoop(sorting.MaximumProductSorting, arrNums, arrWant, n)
}
#+end_src
** Explanation
** Constraints
** Examples
* 0704. BINARY SEARCH
** Source
*** Go
#+NAME: binary-search
#+begin_src go :tangle ./0704_binary-search/main.go :noweb yes :comments link

// Given an array of integers nums which is sorted in ascending order, and an integer target, write a function to search target in nums.
// If target exists, then return its index. Otherwise, return -1.
//
// You must write an algorithm with O(log n) runtime complexity.
//
// https://leetcode.com/problems/binary-search/
//
// Constraints:
//
//   - 1 <= nums.length <= 104
//   - -104 < nums[i], target < 104
//   - All the integers in nums are unique.
//   - nums is sorted in ascending order.
package main

import (
	"fmt"
	"log"
	"sort"
	"stdout"
)

// Runtime: 31 ms, faster than 95.31% of Go online submissions for Binary Search.
// Memory Usage: 6.7 MB, less than 94.48% of Go online submissions for Binary Search.
//
// Runtime: 32 ms, faster than 93.68% of Go online submissions for Binary Search.
// Memory Usage: 6.5 MB, less than 99.96% of Go online submissions for Binary Search.
func searchDivideAndConquer(nums []int, target int) int {
	low, high := 0, len(nums)-1 // left: is the first position at 0// right: 0 index means we subtract one from len
	for low <= high {
		mid := (low + high) / 2
		if nums[mid] == target {
			return mid // If target is in the middle itself
		} else if nums[mid] > target {
			high-- // high = mid - 1 //  else the target can only be present in the left subarray/slice
		} else {
			low++ // low = low + 1 // If target is less than mid then it will be in the right subarray/slice
		}
	}
	return -1
}

// Runtime: 40 ms, faster than 72.72% of Go online submissions for Binary Search.
// Memory Usage: 7.1 MB, less than 53.18% of Go online submissions for Binary Search.
//
// Runtime: 33 ms, faster than 91.94% of Go online submissions for Binary Search.
// Memory Usage: 7 MB, less than 61.39% of Go online submissions for Binary Search.
func searchBruteForce(nums []int, target int) int {
	for i := 0; i < len(nums); i++ {
		if nums[i] == target {
			return i
		}
	}
	return -1
}

func main() {
	log.SetFlags(log.Ldate | log.Lshortfile)
	log.Println("| 0704_binary-search/main.go: main()")
	nums := []int{-1, 0, 3, 5, 9, 12}
	target := 9

	searchRunMain()

	output := SearchForLoop(nums, target)
	fmt.Printf("\nSearchForLoop:%2v\n", output)

	nums, target, _ = getNumsTargets()
	outputIterative := SearchIterative(nums, target)
	fmt.Println("\nSearchIterative:", outputIterative)

	// nums, target, _ = getRandomNumsSlice(20)
	// outputIterative = SearchIterative(nums, target)
	// fmt.Println("\nSearchIterative:", outputIterative)

	nums = []int{-1, 0, 3, 5, 9, 12}
	target = 3
	// nums, target, _ = getRandomNumsSlice(20)
	outputRecursive := SearchRecursive(nums, target, 0, len(nums))
	fmt.Println("\nSearchRecursive:", outputRecursive)

	nums = []int{-1, 0, 3, 5, 9, 12}
	target = 1
	// nums, target, _ = getRandomNumsSlice(20)
	outputRecursive = SearchRecursive(nums, target, 0, len(nums))
	fmt.Printf("\nSearchRecursive: %2v \n\n", outputRecursive)
	// stdout.OutputToFile("file.log")

	stdout.OutputToFile("")

}
#+end_src
*** Go Recursive
#+begin_example go

// Binary Search Algorithm: The basic steps to perform Binary Search are:
//
// https://www.geeksforgeeks.org/binary-search/
//
//	Begin with the mid element of the whole array as a search key.
//	If the value of the search key is equal to the item then return an index of the search key.
//	Or if the value of the search key is less than the item in the middle of the interval, narrow the interval to the lower half.
//	Otherwise, narrow it to the upper half.
//	Repeatedly check from the second point until the value is found or the interval is empty.
//
// # Binary Search Algorithm can be implemented in the following two ways
//
// Iterative Method
// Recursive Method

// SearchRecursive
//
// Credits: https://www.geeksforgeeks.org/binary-search/
//
// l, r := 0, len(nums)-1 // left & right
func SearchRecursive(nums []int, target int, l, r int) int {
	if r >= l {
		mid := (r + l) / 2 // Or l + (r - l) / 2.

		if nums[mid] == target {
			return mid // If the target is in the middle itself.
		} else if nums[mid] > target {
			rSub := mid - 1 // move to the left
			return SearchRecursive(nums, target, l, rSub)
		} else {
			lAdd := mid + 1 // move to the right
			return SearchRecursive(nums, target, lAdd, r)
		}
	}

	return -1
}

// Runtime: 79 ms, faster than 11.19% of Go online submissions for Binary Search.
// Memory Usage: 7.6 MB, less than 10.50% of Go online submissions for Binary Search.
func searchRecursive(nums []int, target int) int {
	return binarySearchRecursive(nums, target, 0, len(nums)-1)
}

// Runtime: 79 ms, faster than 11.19% of Go online submissions for Binary Search.
// Memory Usage: 7.6 MB, less than 10.50% of Go online submissions for Binary Search.
func binarySearchRecursive(nums []int, target, left, right int) int {
	var output int
	if left > right {
		return -1
	}
	mid := (left + right) / 2
	if nums[mid] == target {
		return mid
	} else if target < nums[mid] {
		output = binarySearchRecursive(nums, target, left, mid-1)
	} else {
		output = binarySearchRecursive(nums, target, mid+1, right)
	}
	return output
}

#+end_example

